fun main() {
    val library = BookList()
    val books = listOf(
        Book(1, "Александр Пушкин", "Евгений Онегин", 1833, "Издательство 1", 300),
        Book(2, "Лев Толстой", "Война и мир", 1869, "Издательство 2", 1200),
        Book(3, "Федор Достоевский", "Преступление и наказание", 1866, "Издательство 3", 500),
        Book(4, "Эрих Мария Ремарк", "Три товарища", 1936, "Издательство 4", 400)
    )
    library.input(books)

    println("Все книги:")
    library.display()

    println("\nКниги, изданные после 1900 года:")
    library.filter { it.year > 1900 }
}
